Revit 2024 API
PointOnEdgeEdgeIntersection.GetEdgeReference1 Method
Get a copy of the first edge or curve reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Reference GetEdgeReference1()
Visual Basic
Public Function GetEdgeReference1 As Reference
Visual C++
public:
Reference^ GetEdgeReference1()
See Also
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace